
/*******************************************************************************
* 文件名          : main.c
* 作者            : 沙楠
* 时间			      : 2020.02.26
* 文件描述        : 智能浇灌系统主函数
* 备注			  :	stm32f10x.h头文件主要完成对所用stm32芯片的选择。如本实验所用
                    的为stm32f103zet6，属于大容量芯片，所以配置在第53行为了
					STM32F10X_HD以及定义了USE_STDPERIPH_DRIVER，从而引入
					stm32f10x_conf.h文件
********************************************************************************/

/* 头文件    ------------------------------------------------------------------*/
#include "stm32f10x.h"
#include "gizwits_product.h"
#include "key.h"
#include "oled.h"
#include "delay.h"

#include "stmflash.h"
/* 自定义同义关键字    --------------------------------------------------------*/

/* 自定义参数宏        --------------------------------------------------------*/

/* 自定义函数宏        --------------------------------------------------------*/

/* 自定义变量          --------------------------------------------------------*/
uint32_t time_count1=0;//对时间计数，1s计一次
uint32_t time_count2=0;//对时间计数，1s计一次
uint32_t time_count3=0;//对时间计数，1s计一次
uint32_t time_count4=0;//对时间计数，1s计一次
int8_t water_flag=0;//换水时间标志
int16_t control_flag=0;//自动模式(0),手动模式(1)
/* 自定义函数声明--------------------------------------------------------*/

/*******************************************************************************
**函数名：main
**输入  : 无
**输出  : 无
**描述  ：主函数
*******************************************************************************/



int main (void)
{
	userInit();//设备初始化
	while(1)
	{ 		
		
	}
}	
